RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_hal_hrtim.h
#define IS_HRTIM_AUTODELAYEDMODE(AUTODELAYEDMODE)\
              (((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_REGULAR)                  || \
               ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_NOTIMEOUT)    || \
               ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP1)  || \
               ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP3))

/* Auto delayed mode is only available for compare units 2 and 4U */
#define IS_HRTIM_COMPAREUNIT_AUTODELAYEDMODE(COMPAREUNIT, AUTODELAYEDMODE)     \
    ((((COMPAREUNIT) == HRTIM_COMPAREUNIT_2) &&                                 \
     (((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_REGULAR)                 ||  \
      ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_NOTIMEOUT)   ||  \
      ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP1) ||  \
      ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP3)))   \
    ||                                                                         \
    (((COMPAREUNIT) == HRTIM_COMPAREUNIT_4) &&                                 \
     (((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_REGULAR)                 ||  \
      ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_NOTIMEOUT)   ||  \
      ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP1) ||  \
      ((AUTODELAYEDMODE) == HRTIM_AUTODELAYEDMODE_AUTODELAYED_TIMEOUTCMP3))))

#define IS_HRTIM_OUTPUTPOLARITY(OUTPUTPOLARITY)\
              (((OUTPUTPOLARITY) == HRTIM_OUTPUTPOLARITY_HIGH) || \
               ((OUTPUTPOLARITY) == HRTIM_OUTPUTPOLARITY_LOW))

#define IS_HRTIM_OUTPUTPULSE(OUTPUTPULSE) ((OUTPUTPULSE) <= 0x0000FFFFU)

#define IS_HRTIM_OUTPUTSET(OUTPUTSET)\
              (((OUTPUTSET) == HRTIM_OUTPUTSET_NONE)             || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_RESYNC)           || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMPER)           || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMCMP1)          || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMCMP2)          || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMCMP3)          || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMCMP4)          || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_MASTERPER)        || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_MASTERCMP1)       || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_MASTERCMP2)       || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_MASTERCMP3)       || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_MASTERCMP4)       || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV1_TIMBCMP1) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV2_TIMBCMP2) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV3_TIMCCMP2) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV4_TIMCCMP3) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV5_TIMDCMP1) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV6_TIMDCMP2) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV7_TIMECMP3) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV8_TIMECMP4) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_TIMAEV9_TIMFCMP4) || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_1)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_2)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_3)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_4)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_5)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_6)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_7)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_8)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_9)            || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_EEV_10)           || \
               ((OUTPUTSET) == HRTIM_OUTPUTSET_UPDATE))

#define IS_HRTIM_OUTPUTRESET(OUTPUTRESET)\
              (((OUTPUTRESET) == HRTIM_OUTPUTRESET_NONE)             || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_RESYNC)           || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMPER)           || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMCMP1)          || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMCMP2)          || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMCMP3)          || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMCMP4)          || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_MASTERPER)        || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_MASTERCMP1)       || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_MASTERCMP2)       || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_MASTERCMP3)       || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_MASTERCMP4)       || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV1_TIMBCMP1) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV2_TIMBCMP2) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV3_TIMCCMP2) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV4_TIMCCMP3) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV5_TIMDCMP1) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV6_TIMDCMP2) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV7_TIMECMP3) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV8_TIMECMP4) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_TIMAEV9_TIMFCMP4) || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_1)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_2)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_3)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_4)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_5)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_6)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_7)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_8)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_9)            || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_EEV_10)           || \
               ((OUTPUTRESET) == HRTIM_OUTPUTRESET_UPDATE))

#define IS_HRTIM_OUTPUTIDLEMODE(OUTPUTIDLEMODE)\
              (((OUTPUTIDLEMODE) == HRTIM_OUTPUTIDLEMODE_NONE) || \
               ((OUTPUTIDLEMODE) == HRTIM_OUTPUTIDLEMODE_IDLE))

